

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	УчетнаяПолитикаСрезПоследних.Регистратор,
	|	УчетнаяПолитикаСрезПоследних.МетодСписания
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&ДатаСреза, ) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Результат=Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Данные=Результат.Выбрать();
		Данные.Следующий();
		Партия = ?(Данные.МетодСписания=Перечисления.МетодыСписания.ПоСредней, Данные.Регистратор, Ссылка);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена учетная политика.";
		Сообщение.Сообщить();
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиНоменклатуры.Записывать=Истина;
	Движения.ОстаткиНоменклатуры.Очистить();
	
	Для Каждого Строка из СписокНоменклатуры Цикл
		Движение=Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период=Дата;
		Движение.Номенклатура=Строка.Номенклатура;
		Движение.Партия=Партия;
		Движение.Количество=Строка.Количество;
		Движение.Сумма=Строка.Сумма;
	КонецЦикла;
	
КонецПроцедуры

