
// Рассчитать начисления.
// 
// Параметры:
//  Регистратор Регистратор
Процедура РассчитатьНачисления(Регистратор) Экспорт

	НаборЗаписей = РегистрыРасчета.ОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить (Регистратор);
	НаборЗаписей.Прочитать();
	
	//Оклад
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				  |	ОсновныеНачисленияДанныеГрафика.Параметр,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоЧасовФактическийПериодДействия, 0) КАК ЧасовФакт,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоЧасовПериодДействия, 0) КАК ЧасовПлан
				  |ИЗ
				  |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
				  |			Регистратор = &Регистратор
				  |				И ВидРасчета = &ВидРасчетаОклад) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);

	СтруктураПоиска=Новый СТруктура;
	СтруктураПоиска.Вставить("НомерСтроки", 0);
	Выборка=Запрос.Выполнить().Выбрать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки=Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Сторно=?(Запись.Сторно, -1, 1);
			Запись.Результат = Сторно * ?(Выборка.ЧасовПлан = 0, 0, Выборка.ЧасовФакт / Выборка.ЧасовПлан
				* Выборка.Параметр);
			Запись.ОтработаноЧасов=Сторно * Выборка.ЧасовФакт;
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;

	НаборЗаписей.Записать( , Истина);
	
	//Вечерние часы
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				  |	ОсновныеНачисленияДанныеГрафика.Параметр,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ВечернихЧасовФактическийПериодДействия, 0) КАК ВечернихЧасовФакт,
				  |	ОсновныеНачисленияДанныеГрафика.КоличествоЧасовПериодДействия КАК ЧасовПлан
				  |ИЗ
				  |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
				  |			Регистратор = &Регистратор
				  |				И ВидРасчета = &ВидРасчетаВечерниеЧасы) КАК ОсновныеНачисленияДанныеГрафика";

	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВидРасчетаВечерниеЧасы", ПланыВидовРасчета.ОсновныеНачисления.ВечерниеЧасы);

	СтруктураПоиска=Новый СТруктура;
	СтруктураПоиска.Вставить("НомерСтроки", 0);
	Выборка=Запрос.Выполнить().Выбрать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки=Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Сторно=?(Запись.Сторно, -1, 1);
			Запись.Результат = Сторно * ?(Выборка.ЧасовПлан = 0, 0, Выборка.Параметр / Выборка.ЧасовПлан
				* Выборка.ВечернихЧасовФакт);
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;

	НаборЗаписей.Записать( , Истина);
	
	
	
	//Командировка
	Запрос.Текст= "ВЫБРАТЬ
				  |	ОсновныеНачисленияДанныеГрафика.НомерСтроки,
				  |	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоЧасовФактическийПериодДействия, 0) КАК ЧасовФакт,
				  |	ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК База,
				  |	ЕСТЬNULL(ОсновныеНачисленияБазаОсновныеНачисления.ОтработаноЧасовБаза, 0) КАК ЧасовБаза
				  |ИЗ
				  |	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
				  |			Регистратор = &Регистратор
				  |				И ВидРасчета = &ВидРасчетаКомандировка) КАК ОсновныеНачисленияДанныеГрафика
				  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.БазаОсновныеНачисления(
				  |				&Измерения,
				  |				&Измерения,
				  |				,
				  |				Регистратор = &Регистратор
				  |					И ВидРасчета = &ВидРасчетаКомандировка) КАК ОсновныеНачисленияБазаОсновныеНачисления
				  |		ПО ОсновныеНачисленияДанныеГрафика.НомерСтроки = ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки";

	Измерения=Новый Массив(2);
	Измерения[0]="Сотрудник";
	Измерения[1]="Подразделение";

	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("ВидРасчетаКомандировка", ПланыВидовРасчета.ОсновныеНачисления.Командировка);

	СтруктураПоиска=Новый СТруктура;
	СтруктураПоиска.Вставить("НомерСтроки", 0);
	Выборка=Запрос.Выполнить().Выбрать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтруктураПоиска.НомерСтроки=Запись.НомерСтроки;
		Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
			Запись.Результат = ?(Выборка.ЧасовБаза = 0, 0, Выборка.База / Выборка.ЧасовБаза * Выборка.ЧасовФакт);
		КонецЕсли;
		Выборка.Сбросить();
	КонецЦикла;

	НаборЗаписей.Записать( , Истина);
КонецПроцедуры